{
  "List": [
    {
      "id": 1,
      "name": "Avengers: Endgame",
      "iframe": "https://www.2embed.cc/embed/299534",
      "overview": "After the devastating events of Avengers: Infinity War, the universe is in ruins due to the efforts of the Mad Titan, Thanos. With the help of remaining allies, the Avengers must assemble once more in order to undo Thanos' actions and restore order to the universe once and for all, no matter what consequences may be in store.",
      "img": "https://img.hdtoday.tv/xxrz/250x400/394/d5/c9/d5c931df6080a426ed559d24896d5349/d5c931df6080a426ed559d24896d5349.jpg",
      "genre": "Action",
      "country": "USA",
      "release": "2019"
    },
    {
      "id": 2,
      "name": "John Wick: Chapter 4",
      "iframe": "https://www.2embed.cc/embed/603692",
      "overview": "With the price on his head ever increasing John Wick uncovers a path to defeating The High Table.But before he can earn his freedom Wick must face off against a new enemy with powerful alliances across the globe and forces that turn old friends into foes",
      "img": "https://www.2embed.cc/thumbs/john-wick-chapter-4-2023.jpg",
      "genre": "Action",
      "country": "USA",
      "release": "2023"
    },
    {
      "id": 3,
      "name": "Thor: Love and Thunder",
      "iframe": "https://www.2embed.cc/embed/tt10648342",
      "overview": "Thor's retirement is interrupted by a galactic killer known as Gorr the God Butcher, who seeks the extinction of the gods. To combat the threat, Thor enlists the help of King Valkyrie, Korg and ex-girlfriend Jane Foster, who - to Thor's surprise - inexplicably wields his magical hammer, Mjolnir, as the Mighty Thor. Together, they embark upon a harrowing cosmic adventure to uncover the mystery of the God Butcher's vengeance and stop him before it's too late.",
      "img": "https://www.2embed.cc/thumbs/thor-love-and-thunder-2022.jpg",
      "genre": "Action",
      "country": "USA",
      "release": "2022"
    },
    {
      "id": 4,
      "name": "Fast X",
      "iframe": "https://www.2embed.cc/embed/385687",
      "overview": "Over many missions and against impossible odds, Dom Toretto and his family have outsmarted, out-nerved and outdriven every foe in their path. Now, they confront the most lethal opponent they've ever faced: A terrifying threat emerging from the shadows of the past who's fueled by blood revenge, and who is determined to shatter this family and destroy everything—and everyone—that Dom loves, forever.",
      "img": "https://www.2embed.cc/thumbs/fast-x-2023.jpg",
      "genre": "Action,Adventure,Crime,Drama,Thriller",
      "country": "USA",
      "release": "2023"
    },
    {
      "id": 5,
      "name": "Thor: Ragnarok",
      "iframe": "https://www.2embed.cc/embed/tt3501632",
      "overview": "Thor (Chris Hemsworth) is imprisoned on the other side of the universe and finds himself in a race against time to get back to Asgard to stop Ragnarök, the destruction of his homeworld and the end of Asgardian civilization, at the hands of an all-powerful new threat, the ruthless Hela (Cate Blanchett).",
      "img": "https://www.2embed.cc/thumbs/thor-ragnarok-2017.jpg",
      "genre": "Action,Adventure,Comedy",
      "country": "USA",
      "release": "2017"
    },
    {
      "id": 6,
      "name": "The Raker House",
      "iframe": "https://www.2embed.cc/embed/1073936",
      "overview": "In a surreal suburbia, a disoriented man with memory loss suspects his mortician wife is behind it.",
      "img": "https://www.2embed.cc/thumbs/the-raker-house-2023.jpg",
      "genre": "Thriller",
      "country": "USA",
      "release": "2023"
    },
    {
      "id": 7,
      "name": "Avatar: The Way of Water",
      "iframe": "https://www.2embed.cc/embed/76600",
      "overview": "Set more than a decade after the events of the first film, learn the story of the Sully family (Jake, Neytiri, and their kids), the trouble that follows them, the lengths they go to keep each other safe, the battles they fight to stay alive, and the tragedies they endure.",
      "img": "https://www.2embed.cc/thumbs/avatar-the-way-of-water-2022.jpg",
      "genre": "Action, Fantasy, Science Fiction, Adventure",
      "country": "USA",
      "release": "2022"
    },
    {
      "id": 8,
      "name": "Fast Five",
      "iframe": "https://www.2embed.cc/embed/tt1596343",
      "overview": "Former cop Brian O'Conner partners with ex-con Dom Toretto on the opposite side of the law. Since Brian and Mia Toretto broke Dom out of custody, they've blown across many borders to elude authorities. Now backed into a corner in Rio de Janeiro, they must pull one last job in order to gain their freedom. As they assemble their elite team of top racers, the unlikely allies know their only shot of getting out for good means confronting the corrupt businessman who wants them dead. But he's not the only one on their tail. Hard-nosed federal agent Luke Hobbs never misses his target. When he is assigned to track down Dom and Brian, he and his strike team launch an all-out assault to capture them. But as his men tear through Brazil, Hobbs learns he can't separate the good guys from the bad. Now, he must rely on his instincts to corner his prey... before someone else runs them down first.",
      "img": "https://www.2embed.cc/thumbs/fast-five-2011.jpg",
      "genre": "Drama, Comedy, Romance",
      "country": "UK",
      "release": "2011"
    },
    {
      "id": 9,
      "name": "Operation Fortune: Ruse de Guerre",
      "iframe": "https://www.2embed.cc/embed/tt7985704",
      "overview": "Five Eyes, the international intelligence agency, recruits MI6 agent Orson Fortune to prevent the sale of a deadly new weapons technology that threatens to disrupt the world order.",
      "img": "https://www.2embed.cc/thumbs/operation-fortune-ruse-de-guerre-2023.jpg",
      "genre": "Action, Thriller, Comedy",
      "country": "Turkey, USA, China",
      "release": "2023"
    },
    {
      "id": 10,
      "name": "Saw",
      "iframe": "https://www.2embed.cc/embed/tt0387564",
      "overview": "Obsessed with teaching his victims the value of life, a deranged, sadistic serial killer abducts the morally wayward. Once captured, they must face impossible choices in a horrific game of survival. The victims must fight to win their lives back, or die trying...",
      "img": "https://www.2embed.cc/thumbs/saw-2004.jpg",
      "genre": "Horror",
      "country": "USA",
      "release": "2004"
    },
    {
      "id": 11,
      "name": "The Nudels of Nudeland",
      "iframe": "https://www.2embed.cc/embed/tt15132568",
      "overview": "In a truly original story that is naked and not afraid, Meet TIM CHIZMAR, he's loud and naked, in America that's how you know he's Tim Chizmar.",
      "img": "https://www.2embed.cc/thumbs/the-nudels-of-nudeland-2022.jpg",
      "genre": "Comedy",
      "country": "USA",
      "release": "2022"
    },
    {
      "id": 12,
      "name": "Regular Show: The Movie",
      "iframe": "https://www.2embed.cc/embed/tt4920274",
      "overview": "After a future, dying Rigby comes to warn the gang about the future, they must time travel back in time to when Mordecai and Rigby were in high school to stop a evil, crazy volleyball coach from destroying time. Will it work? Can Rigby tell the truth even if it will cost him and Mordecai their friendship?",
      "img": "https://www.2embed.cc/thumbs/regular-show-the-movie-2015.jpg",
      "genre": "Action,Adventure,Animation,Comedy,Family,Fantasy,Sci-Fi",
      "country": "USA",
      "release": "2015"
    },
    {
      "id": 13,
      "name": "Paparazzi",
      "iframe": "https://www.2embed.cc/embed/tt0338325",
      "overview": "Bo Laramie (Cole Hauser) is a rising movie star, and Rex Harper (Tom Sizemore) is a paparazzo who will stop at nothing to get a provocative photograph of Bo or his wife (Robin Tunney)",
      "img": "https://www.2embed.cc/thumbs/paparazzi-2004.jpg",
      "genre": "Action,Crime,Drama,Thriller",
      "country": "UK",
      "release": "2004"
    },
    {
      "id": 14,
      "name": "World War Z",
      "iframe": "https://www.2embed.cc/embed/tt0816711",
      "overview": "Life for former United Nations investigator Gerry Lane and his family seems content. Suddenly, the world is plagued by a mysterious infection turning whole human populations into rampaging mindless zombies. After barely escaping the chaos, Lane is persuaded to go on a mission to investigate this disease. What follows is a perilous trek around the world where Lane must brave horrific dangers and long odds to find answers before human civilization falls.",
      "img": "https://www.2embed.cc/thumbs/world-war-z-2013.jpg",
      "genre": "Action,Drama,Thriller,Horror,Adventure",
      "country": "USA",
      "release": "2013"
    },
    {
      "id": 15,
      "name": "The Purge: Anarchy",
      "iframe": "https://www.2embed.cc/embed/tt2975578",
      "overview": "A couple are driving home when their car breaks down just as the Purge commences. Meanwhile, a police sergeant goes out into the streets to get revenge on the man who killed his son, and a mother and daughter run from their home after assailants destroy it. The five people meet up as they attempt to survive the night in Los Angeles.",
      "img": "https://www.2embed.cc/thumbs/the-purge-anarchy-2014.jpg",
      "genre": "Action,Horror,Drama,Thriller",
      "country": "USA",
      "release": "2014"
    },
    {
      "id": 16,
      "name": "The Purge",
      "iframe": "https://www.2embed.cc/embed/tt2184339",
      "overview": "In an America wracked by crime and overcrowded prisons, the government has sanctioned an annual 12-hour period in which any and all criminal activity-including murder-becomes legal. The police can't be called. Hospitals suspend help. It's one night when the citizenry regulates itself without thought of punishment. On this night plagued by violence and an epidemic of crime, one family wrestles with the decision of who they will become when a stranger comes knocking. When an intruder breaks into James Sandin's (Ethan Hawke) gated community during the yearly lockdown, he begins a sequence of events that threatens to tear a family apart. Now, it is up to James, his wife, Mary (Lena Headey), and their kids to make it through the night without turning into the monsters from whom they hide.",
      "img": "https://www.2embed.cc/thumbs/the-purge-2013.jpg",
      "genre": "Action,Horror,Drama,Thriller",
      "country": "USA",
      "release": "2013"
    },
    {
      "id": 17,
      "name": "Black Night Parade",
      "iframe": "https://www.2embed.cc/embed/tt21434474",
      "overview": "An unambitious young man is forced to join a dark Christmas company that delivers bad gifts to bad children.",
      "img": "https://www.2embed.cc/thumbs/the-purge-anarchy-2014.jpg",
      "genre": "Comedy,Fantasy",
      "country": "Japan",
      "release": "2022"
    },
    {
      "id": 18,
      "name": "Avatar",
      "iframe": "https://www.2embed.cc/embed/tt0499549",
      "overview": "When his brother is killed in a robbery, paraplegic Marine Jake Sully decides to take his place in a mission on the distant world of Pandora. There he learns of greedy corporate figurehead Parker Selfridge's intentions of driving off the native humanoid Na'vi in order to mine for the precious material scattered throughout their rich woodland. In exchange for the spinal surgery that will fix his legs, Jake gathers knowledge, of the Indigenous Race and their Culture, for the cooperating military unit spearheaded by gung-ho Colonel Quaritch, while simultaneously attempting to infiltrate the Na'vi people with the use of an avatar identity. While Jake begins to bond with the native tribe and quickly falls in love with the beautiful alien Neytiri, the restless Colonel moves forward with his ruthless extermination tactics, forcing the soldier to take a stand - and fight back in an epic battle for the fate of Pandora.",
      "img": "https://www.2embed.cc/thumbs/avatar-2009.jpg",
      "genre": "Action,Adventure,Sci-Fi",
      "country": "USA",
      "release": "2009"
    },
    {
      "id": 19,
      "name": "Saw II",
      "iframe": "https://www.2embed.cc/embed/tt0432348",
      "overview": "Detective Eric Matthews, along with fellow police officers and a SWAT Team, locate Jigsaw's lair and go to arrest him, but discover that his arrest is only a part of Jigsaw's plan. Matthews soon learns that eight people are trapped in an old house and are playing one of Jigsaw's games. One of them is his own son, Daniel Matthews. Eric learns that if he wants to see his son again, he must play one of Jigsaw's games as well.",
      "img": "https://www.2embed.cc/thumbs/saw-ii-2005.jpg",
      "genre": "Action,Adventure,Crime,Fantasy,Horror,Mystery,Romance",
      "country": "USA",
      "release": "2005"
    },
    {
      "id": 20,
      "name": "The Purge: Election Year",
      "iframe": "https://www.2embed.cc/embed/tt4094724",
      "overview": "It's been two years since Leo Barnes (Frank Grillo) stopped himself from a regrettable act of revenge on Purge Night. Now serving as head of security for Senator Charlie Roan (Elizabeth Mitchell), his mission is to protect her in a run for president and survive the annual ritual that targets the poor and innocent. But when a betrayal forces them onto the streets of D.C. on the one night when no help is available, they must stay alive until dawn...or both be sacrificed for their sins against the state.",
      "img": "https://www.2embed.cc/thumbs/the-purge-election-year-2016.jpg",
      "genre": "Action,Horror,Drama,Thriller",
      "country": "USA",
      "release": "2016"
    },
    {
      "id": 21,
      "name": "Saw III",
      "iframe": "https://www.2embed.cc/embed/tt0489270",
      "overview": "Jeff is an anguished man who grieves and misses his son that was killed by a drunk driver in a car accident. He has become obsessed for revenge against the drunk driver, judge, and only witness who refused to testify; he has also become neglectful of his daughter. Lynn Denlon is a skilled surgeon that is cheating on her husband and suffering from depression. Both are abducted and brought to Jigsaw's warehouse, where they must play two separate games: Jeff must choose whether to save or let the people he holds responsible for the death of his son die, while Lynn must keep Jigsaw alive until Jeff completes his tests, or face the deadly consequences.",
      "img": "https://www.2embed.cc/thumbs/saw-iii-2006.jpg",
      "genre": "Action,Horror,Drama,Thriller",
      "country": "USA",
      "release": "2006"
    },
    {
      "id": 22,
      "name": "Saw IV",
      "iframe": "https://www.2embed.cc/embed/tt0890870",
      "overview": "Jigsaw and his apprentice Amanda are dead. Now, upon the news of Detective Kerry's murder, two seasoned FBI profilers, Agent Strahm and Agent Perez, arrive in the terrified community to assist the veteran Detective Hoffman in sifting through Jigsaw's latest grisly remains and piecing together the puzzle. However, when SWAT Commander Rigg is abducted and thrust into a game, the last officer untouched by Jigsaw has but ninety minutes to overcome a series of demented traps and save an old friend or face the deadly consequences.",
      "img": "https://www.2embed.cc/thumbs/saw-iv-2007.jpg",
      "genre": "Action,Horror,Drama,Thriller",
      "country": "USA",
      "release": "2007"
    },
    {
      "id": 23,
      "name": "Saw V",
      "iframe": "https://www.2embed.cc/embed/tt1132626",
      "overview": "Detective Mark Hoffman is deemed a hero after he saves a young girl and escapes one of Jigsaw's games, or so it seems. Special Agent Peter Strahm is suspicious of him after an injured Agent Lindsay Perez says Hoffman's name. While Agent Strahm looks into Detective Hoffman's past, five people, who helped burn down a building which was supposedly abandoned, face a series of tests set up by Jigsaw.",
      "img": "https://www.2embed.cc/thumbs/saw-v-2008.jpg",
      "genre": "Action,Horror,Drama,Thriller",
      "country": "USA",
      "release": "2008"
    },
    {
      "id": 24,
      "name": "Saw VI",
      "iframe": "https://www.2embed.cc/embed/tt1233227",
      "overview": "Special Agent Strahm is dead, and Detective Hoffman has emerged as the unchallenged successor to Jigsaw's legacy. However, when the FBI draws closer to Hoffman, he is forced to set a game into motion, and Jigsaw's grand scheme is finally understood.",
      "img": "https://www.2embed.cc/thumbs/saw-vi-2009.jpg",
      "genre": "Action,Horror,Drama,Thriller",
      "country": "USA",
      "release": "2009"
    },
    {
      "id": 25,
      "name": "Sniper: Legacy",
      "iframe": "https://www.2embed.cc/embed/tt3776288",
      "overview": "A rogue assassin is taking out military leaders, and Brandon gets word that his father is one. He tries to track down the killer, finds out that his father isn't dead and realizes that his superior officers are using him as bait to track the killer.",
      "img": "https://www.2embed.cc/thumbs/sniper-legacy-2014.jpg",
      "genre": "Action,Adventure,Fantasy",
      "country": "USA,UK",
      "release": "2014"
    },
    {
      "id": 26,
      "name": "Doctor Strange",
      "iframe": "https://www.2embed.cc/embed/tt1211837",
      "overview": "Marvel's Doctor Strange follows the story of the talented neurosurgeon Doctor Stephen Strange who, after a tragic car accident, must put ego aside and learn the secrets of a hidden world of mysticism and alternate dimensions. Based in New York City's Greenwich Village, Doctor Strange must act as an intermediary between the real world and what lies beyond, utilising a vast array of metaphysical abilities and artifacts to protect the Marvel Cinematic Universe.",
      "img": "https://www.2embed.cc/thumbs/doctor-strange-2016.jpg",
      "genre": "Action,Adventure,Fantasy",
      "country": "USA",
      "release": "2016"
    },
    {
      "id": 27,
      "name": "Saw: The Final Chapter",
      "iframe": "https://www.2embed.cc/embed/tt1477076",
      "overview": "Detective Matt Gibson chases the psychotic Detective Mark Hoffman while Jigsaw's widow Jill Tuck tries to kill him as assigned by her husband. However he escapes and Jill meets Gibson and offers to sign an affidavit listing the murders committed by Hoffman. In return, she requests protection. Meanwhile, the prominent Jigsaw survivor and leader of a support group Bobby Dagen is abducted with his wife and friends and forced to play a mortal game to save not only his wife, but three of his colleagues as well.",
      "img": "https://www.2embed.cc/thumbs/saw-the-final-chapter-2010.jpg",
      "genre": "Action,Horror,Drama,Thriller",
      "country": "USA",
      "release": "2014"
    },
    {
      "id": 28,
      "name": "Doraemon: New Nobita's Great Demon-Peko and the Exploration Party of Five",
      "iframe": "https://www.2embed.cc/embed/tt3949650",
      "overview": "Nobita finds a stray dog and brings him home, little does hi knows that the dog is actually a prince in his homeland, a world appart deep in the african 'Smokers Forest' were the dogs evolved and have their own empire, so he and his friends take on a journey to take back the young prince to his homeland but when they get there things have changed.",
      "img": "https://www.2embed.cc/thumbs/doraemon-new-nobitas-great-demonpeko-and-the-exploration-party-of-five-2014.jpg",
      "genre": "Action,Adventure,Animation,Comedy,Fantasy,Mystery,Sci-Fi",
      "country": "Japan",
      "release": "2014"
    },
    {
      "id": 29,
      "name": "Dara of Jasenovac",
      "iframe": "https://www.2embed.cc/embed/tt10554232",
      "overview": "The film is set in the Nazi-occupied Croatian Ustasha regime NDH in former Yugoslavia during WWII. The film is told through the experiences of a little girl named Dara who is sent as a child during the Holocaust in the Balkans to the infamous extermination camp complex Jasenovac, also known as Balkan 's Auschwitz when it was ruled by sadistic camp commander Maks Luburic until the liberation. The film is the first modern WWII movie that takes place in or shows this NDH era camp.",
      "img": "https://www.2embed.cc/thumbs/dara-of-jasenovac-2020.jpg",
      "genre": "Drama,War",
      "country": "Russia,Serbia",
      "release": "2020"
    },
    {
      "id": 30,
      "name": "One Soldier's Story: The Journey of American Sniper",
      "iframe": "https://www.2embed.cc/embed/tt4781700",
      "overview": "Join director Clint Eastwood and his creative team, along with Bradley Cooper and Sienna Miller, as they overcome enormous creative and logistic obstacles to make a film that brings the truth of Navy SEAL Chris Kyle's story to the screen.",
      "img": "https://www.2embed.cc/thumbs/one-soldiers-story-the-journey-of-american-sniper-2015.jpg",
      "genre": "Action",
      "country": "USA",
      "release": "2015"
    },
    {
      "id": 31,
      "name": "Bride of Chucky",
      "iframe": "https://www.2embed.cc/embed/tt0144120",
      "overview": "Chucky hooks up with another murderous doll, the bridal gown-clad Tiffany, for a Route 66 murder spree with their unwitting hosts, two eloping high-school graduates.",
      "img": "https://www.2embed.cc/thumbs/bride-of-chucky-1998.jpg",
      "genre": "Comedy,Fantasy,Horror,Romance",
      "country": "USA",
      "release": "1998"
    },
    {
      "id": 32,
      "name": "Devilreaux",
      "iframe": "https://www.2embed.cc/embed/tt8010548",
      "overview": "A series of murders in 1800s will be avenged by forbidden voodoo, woken up accidentally by a group of teenagers.",
      "img": "https://www.2embed.cc/thumbs/devilreaux-2023.jpg",
      "genre": "Horror,Thriller",
      "country": "USA",
      "release": "2023"
    },
    {
      "id": 33,
      "name": "Titanic",
      "iframe": "https://www.2embed.cc/embed/tt0120338",
      "overview": "84 years later, a 100 year-old woman named Rose DeWitt Bukater tells the story to her granddaughter Lizzy Calvert, Brock Lovett, Lewis Bodine, Bobby Buell and Anatoly Mikailavich on the Keldysh about her life set in April 10th 1912, on a ship called Titanic when young Rose boards the departing ship with the upper-class passengers and her mother, Ruth DeWitt Bukater, and her fiancé, Caledon Hockley. Meanwhile, a drifter and artist named Jack Dawson and his best friend Fabrizio De Rossi win third-class tickets to the ship in a game. And she explains the whole story from departure until the death of Titanic on its first and last voyage April 15th, 1912 at 2:20 in the morning.",
      "img": "https://www.2embed.cc/thumbs/titanic-1997.jpg",
      "genre": "Action,Drama,Romance",
      "country": "USA",
      "release": "1997"
    },
    {
      "id": 34,
      "name": "28 Days Later...",
      "iframe": "https://www.2embed.cc/embed/tt0289043",
      "overview": "Animal activists invade a laboratory with the intention of releasing chimpanzees that are undergoing experimentation, infected by a virus -a virus that causes rage. The naive activists ignore the pleas of a scientist to keep the cages locked, with disastrous results. Twenty-eight days later, our protagonist, Jim, wakes up from a coma, alone, in an abandoned hospital. He begins to seek out anyone else to find London is deserted, apparently without a living soul. After finding a church, which had become inhabited by zombie like humans intent on his demise, he runs for his life. Selena and Mark rescue him from the horde and bring him up to date on the mass carnage and horror as all of London tore itself apart. This is a tale of survival and ultimately, heroics, with nice subtext about mankind's savage nature.",
      "img": "https://www.2embed.cc/thumbs/28-days-later-2002.jpg",
      "genre": "Action,Drama,Horror,Sci-Fi,Thriller",
      "country": "UK",
      "release": "2002"
    },
    {
      "id": 35,
      "name": "Parasite",
      "iframe": "https://www.2embed.cc/embed/tt6751668",
      "overview": "The Kims - mother and father Chung-sook and Ki-taek, and their young adult offspring, son Ki-woo and daughter Ki-jung - are a poor family living in a shabby and cramped half basement apartment in a busy lower working class commercial district of Seoul. Without even knowing it, they, especially Mr. and Mrs. Kim, literally smell of poverty.",
      "img": "https://www.2embed.cc/thumbs/parasite-2019.jpg",
      "genre": "Comedy,Crime,Drama,Thriller",
      "country": "Korea",
      "release": "2019"
    },
    {
      "id": 36,
      "name": "Come and See",
      "iframe": "https://www.2embed.cc/embed/tt0091251",
      "overview": "The feature film directed by Elem Klimov, shot in the genre of military drama. The action takes place on the territory of Belarus in 1943. In the center of the story is a Belarusian boy, who witnesses the horrors of the Nazi punitive action, turning from a cheerful teenager into a gray-haired old man for two days.",
      "img": "https://www.2embed.cc/thumbs/come-and-see-1985.jpg",
      "genre": "Drama,Thriller,War",
      "country": "Russia",
      "release": "1985"
    },
    {
      "id": 37,
      "name": "Zombieland",
      "iframe": "https://www.2embed.cc/embed/tt1156398",
      "overview": "Searching for family. In the early twenty-first century, zombies have taken over America. A shy and inexperienced college student in Texas has survived by following his 30 rules: such as look in the back seatdouble-tap,avoid public restrooms. He decides to travel to Ohio to see if his parents are alive. He gets a ride with a boisterous zombie-hating good-old boy headed for Florida, and soon they confront a young woman whose sister has been bitten by a zombie and wants to be put out of her misery. The sisters were headed to an LA amusement park they've heard is zombie free. Can the kid from Ohio get to his family? And what about rule thirty one?",
      "img": "https://www.2embed.cc/thumbs/zombieland-2009.jpg",
      "genre": "Action,Adventure,Comedy,Fantasy,Horror,Sci-Fi",
      "country": "USA",
      "release": "2009"
    },
    {
      "id": 38,
      "name": "Zombieland: Double Tap",
      "iframe": "https://www.2embed.cc/embed/tt1560220",
      "overview": "One long decade after the post-apocalyptic events in Zombieland (2009), the resilient quartet of survivors--the tough-as-nails zombie exterminator, Tallahassee; his rule-making comrade, Columbus; the free-spirited huntress, Wichita, and her younger sister, Little Rock--find themselves in the bosom of a now-derelict White House. However, in a rabid world still overrun by multitudes of walking dead and mutated strains of evolved animated corpses, a premeditated separation will send the team back to square one, searching, once more, for the promised land. Now, all hope rests on Babylon: an entirely organic commune of blissful vegetarian pacifists who love to party. Is this the end of the road?",
      "img": "https://www.2embed.cc/thumbs/zombieland-double-tap-2019.jpg",
      "genre": "Action,Adventure,Comedy,Fantasy,Horror,Sci-Fi",
      "country": "USA",
      "release": "2019"
    },
    {
      "id": 39,
      "name": "The Fast and the Furious",
      "iframe": "https://www.2embed.cc/embed/tt0232500",
      "overview": "Los Angeles street racer Dominic Toretto falls under the suspicion of the LAPD as a string of high-speed electronics truck robberies rocks the area. Brian O'Connor, an officer of the LAPD, joins the ranks of Toretto's highly skilled racing crew undercover to convict Toretto. However, O'Connor finds himself both enamored with this new world and in love with Toretto's sister, Mia. As a rival racing crew gains strength, O'Connor must decide where his loyalty really lies.",
      "img": "https://www.2embed.cc/thumbs/the-fast-and-the-furious-2001.jpg",
      "genre": "Action,Adventure,Crime,Drama,Thriller",
      "country": "USA",
      "release": "2001"
    },
    {
      "id": 40,
      "name": "Olympus Has Fallen",
      "iframe": "https://www.2embed.cc/embed/tt2302755",
      "overview": "When the White House (Secret Service Code: Olympus) is captured by a terrorist mastermind and the President is kidnapped, former Presidential Secret Service Agent Mike Banning finds himself trapped within the building. As our national security team scrambles to respond, they are forced to rely on Banning's inside knowledge to help retake the White House, save the President and avert an even bigger disaster.",
      "img": "https://www.2embed.cc/thumbs/olympus-has-fallen-2013.jpg",
      "genre": "Action,Adventure,Drama,Thriller",
      "country": "USA",
      "release": "2013"
    },
    {
      "id": 41,
      "name": "Furious 7",
      "iframe": "https://www.2embed.cc/embed/tt2820852",
      "overview": "Dominic and his crew thought they'd left the criminal mercenary life behind. They'd defeated international terrorist Owen Shaw and went their separate ways. But now, Shaw's brother, Deckard Shaw, is out killing the crew one by one for revenge. Worse, a Somalian terrorist called Jakarde and a shady government official called Mr. Nobody are both competing to steal a computer terrorism program called God's Eye, that can turn any technological device into a weapon. Torretto must reconvene with his team to stop Shaw and retrieve the God's Eye program while caught in a power struggle between the terrorist and the United States government.",
      "img": "https://www.2embed.cc/thumbs/furious-7-2015.jpg",
      "genre": "Action,Adventure,Crime,Drama,Thriller",
      "country": "USA",
      "release": "2015"
    },
    {
      "id": 42,
      "name": "2 Fast 2 Furious",
      "iframe": "https://www.2embed.cc/embed/tt0322259",
      "overview": "EX LAPD cop Brian O'Conner (Paul Walker) teams up with his ex-con friend Roman Pearce (Tyrese Gibson) and works with undercover U.S. Customs Service agent Monica Fuentes (Eva Mendes) to bring Miami-based drug lord Carter Verone (Cole Hauser) down.",
      "img": "https://www.2embed.cc/thumbs/2-fast-2-furious-2003.jpg",
      "genre": "Action,Adventure,Crime,Drama,Thriller",
      "country": "USA",
      "release": "2003"
    },
    {
      "id": 43,
      "name": "The Dark Knight",
      "iframe": "https://www.2embed.cc/embed/tt0468569",
      "overview": "Set within a year after the events of Batman Begins (2005), Batman, Lieutenant James Gordon, and new District Attorney Harvey Dent successfully begin to round up the criminals that plague Gotham City, until a mysterious and sadistic criminal mastermind known only as The Joker appears in Gotham, creating a new wave of chaos. Batman's struggle against The Joker becomes deeply personal, forcing him to confront everything he believes and improve his technology to stop him. A love triangle develops between Bruce Wayne, Dent, and Rachel Dawes.",
      "img": "https://www.2embed.cc/thumbs/the-dark-knight-2008.jpg",
      "genre": "Action,Adventure,Crime,Drama,Thriller",
      "country": "USA",
      "release": "2008"
    },
    {
      "id": 44,
      "name": "The Dark Knight Rises",
      "iframe": "https://www.2embed.cc/embed/tt1345836",
      "overview": "Despite his tarnished reputation after the events of The Dark Knight (2008), in which he took the rap for Dent's crimes, Batman feels compelled to intervene to assist the city and its Police force, which is struggling to cope with Bane's plans to destroy the city.",
      "img": "https://www.2embed.cc/thumbs/the-dark-knight-rises-2012.jpg",
      "genre": "Action,Adventure,Crime,Drama,Thriller",
      "country": "USA",
      "release": "2012"
    },
    {
      "id": 45,
      "name": "Black Panther",
      "iframe": "https://www.2embed.cc/embed/tt1825683",
      "overview": "After the events of Captain America: Civil War, Prince T'Challa returns home to the reclusive, technologically advanced African nation of Wakanda to serve as his country's new king. However, T'Challa soon finds that he is challenged for the throne from factions within his own country. When two foes conspire to destroy Wakanda, the hero known as Black Panther must team up with C.I.A. agent Everett K. Ross and members of the Dora Milaje, Wakandan special forces, to prevent Wakanda from being dragged into a world war.",
      "img": "https://www.2embed.cc/thumbs/black-panther-2018.jpg",
      "genre": "Action,Adventure,Sci-Fi",
      "country": "USA,Russia",
      "release": "2018"
    },
    {
      "id": 46,
      "name": "The Ghost of Richard Harris",
      "iframe": "https://www.2embed.cc/embed/tt19850910",
      "overview": "The Ghost of Richard Harris was release 2022",
      "img": "https://www.2embed.cc/thumbs/the-ghost-of-richard-harris-2022.jpg",
      "genre": "Drama",
      "country": "USA",
      "release": "2022"
    },
    {
      "id": 47,
      "name": "Siberian Sniper",
      "iframe": "https://www.2embed.cc/embed/tt17074644",
      "overview": "After months of exhausting trench warfare, most of Major Belyaev's battalion was destroyed. The area is ruled by German aces snipers. Hope for replenishment collapses when the convoy, in which the Soviet snipers were traveling, falls under a German airstrike. A handful of soldiers and a young hunter from Yakutia, Yegor Cheerin, survive.—themoviedb",
      "img": "https://www.2embed.cc/thumbs/siberian-sniper-2021.jpg",
      "genre": "Documentary,War,Action",
      "country": "Russia",
      "release": "2021"
    },
    {
      "id": 48,
      "name": "My War",
      "iframe": "https://www.2embed.cc/embed/tt9643064",
      "overview": "A disturbing portrayal of foreign fighters wanting to film themselves in Syria. The complexity of this documentary is what resides in the head of the Canadians that volunteered to help the Kurds. More interested in videoing themselves in the perfect uniform while reciting perfect worded war phases, than ever trying to understand they are in fact, nothing but propaganda for the war effort.—whitfed-1",
      "img": "https://www.2embed.cc/thumbs/my-war-2018.jpg",
      "genre": "War",
      "country": "Documentary,USA",
      "release": "2018"
    },
    {
      "id": 49,
      "name": "War Zone: Bear Grylls meets President Zelenskyy",
      "iframe": "https://www.2embed.cc/embed/tt26763622",
      "overview": "War Zone: Bear Grylls meets President Zelenskyy",
      "img": "https://www.2embed.cc/thumbs/war-zone-bear-grylls-meets-president-zelenskyy-2023.jpg",
      "genre": "Documentary",
      "country": "Russia",
      "release": "2023"
    },
    {
      "id": 50,
      "name": "Captain America: The First Avenger",
      "iframe": "https://www.2embed.cc/embed/tt0458339",
      "overview": "It is 1942, America has entered World War II, and sickly but determined Steve Rogers is frustrated at being rejected yet again for military service. Everything changes when Dr. Erskine recruits him for the secret Project Rebirth. Proving his extraordinary courage, wits and conscience, Rogers undergoes the experiment and his weak body is suddenly enhanced into the maximum human potential",
      "img": "https://www.2embed.cc/thumbs/captain-america-the-first-avenger-2011.jpg",
      "genre": "Action,Adventure,Sci-Fi",
      "country": "USA",
      "release": "2011"
    },
    {
      "id": 51,
      "name": "Thor",
      "iframe": "https://www.2embed.cc/embed/tt0800369",
      "overview": "The warrior Thor (Chris Hemsworth) is cast out of the fantastic realm of Asgard by his father Odin (Sir Anthony Hopkins) for his arrogance and sent to Earth to live amongst humans. Falling in love with scientist Jane Foster (Natalie Portman) teaches Thor much-needed lessons, and his new-found strength comes into play as a villain from his homeland sends dark forces toward Earth.",
      "img": "https://www.2embed.cc/thumbs/thor-2011.jpg",
      "genre": "Action,Adventure,Sci-Fi",
      "country": "USA",
      "release": "2011"
    },
    {
      "id": 52,
      "name": "Thor: The Dark World",
      "iframe": "https://www.2embed.cc/embed/tt1981115",
      "overview": "Thousands of years ago, a race of beings known as Dark Elves tried to send the universe into darkness by using a weapon known as the Aether. Warriors from Asgard stopped them, but their leader Malekith (Christopher Eccleston) escaped to wait for another opportunity",
      "img": "https://www.2embed.cc/thumbs/thor-the-dark-world-2013.jpg",
      "genre": "Action,Adventure,Sci-Fi",
      "country": "USA",
      "release": "2013"
    },
    {
      "id": 53,
      "name": "Furious 7",
      "iframe": "https://www.2embed.cc/embed/tt2820852",
      "overview": "Dominic and his crew thought they'd left the criminal mercenary life behind. They'd defeated international terrorist Owen Shaw and went their separate ways. But now, Shaw's brother, Deckard Shaw, is out killing the crew one by one for revenge. Worse, a Somalian terrorist called Jakarde and a shady government official called Mr. Nobody are both competing to steal a computer terrorism program called God's Eye,that can turn any technological device into a weapon.",
      "img": "https://www.2embed.cc/thumbs/furious-7-2015.jpg",
      "genre": "Action,Adventure,Crime,Drama,Thriller",
      "country": "USA",
      "release": "2015"
    },
    {
      "id": 54,
      "name": "The Fate of the Furious",
      "iframe": "https://www.2embed.cc/embed/tt4630562",
      "overview": "Now that Dominic Toretto (Vin Diesel) and Letty Ortiz (Michelle Rodriguez) are on their honeymoon, and Brian (Paul Walker) and Mia (Jordana Brewster) have retired from the game, and the rest of the crew has been exonerated, the globetrotting team has found a semblance of a normal life. But when a mysterious woman seduces Dom into the world of crime he can't seem to escape, and a betrayal of those closest to him, they will face trials that will test them as never before.",
      "img": "https://www.2embed.cc/thumbs/the-fate-of-the-furious-2017.jpg",
      "genre": "Action,Adventure,Crime,Drama,Thriller",
      "country": "USA",
      "release": "2011"
    },
    {
      "id": 55,
      "name": "Captain America: The Winter Soldier",
      "iframe": "https://www.2embed.cc/embed/tt1843866",
      "overview": "For Steve Rogers, awakening after decades of suspended animation involves more than catching up on pop culture; it also means that this old school idealist must face a world of subtler threats and difficult moral complexities. That becomes clear when Director Nick Fury is killed by the mysterious assassin, the Winter Soldier, but not before warning Rogers that SHIELD has been subverted by its enemies. When Rogers acts on Fury's warning to trust no one there, he is branded as a traitor by the organization",
      "img": "https://www.2embed.cc/thumbs/captain-america-the-winter-soldier-2014.jpg",
      "genre": "Action,Adventure,Sci-Fi",
      "country": "USA",
      "release": "2014"
    },
    {
      "id": 56,
      "name": "Guardians of the Galaxy",
      "iframe": "https://www.2embed.cc/embed/tt2015381",
      "overview": "After stealing a mysterious orb in the far reaches of outer space, Peter Quill from Earth is now the main target of a manhunt led by the villain known as Ronan the Accuser. To help fight Ronan and his team and save the galaxy from his power, Quill creates a team of space heroes known as the Guardians of the Galaxy to save the galaxy.",
      "img": "https://www.2embed.cc/thumbs/guardians-of-the-galaxy-2014.jpg",
      "genre": "Action,Adventure,Sci-Fi,Comedy",
      "country": "USA",
      "release": "2014"
    },
    {
      "id": 57,
      "name": "Captain America: Civil War",
      "iframe": "https://www.2embed.cc/embed/tt3498820",
      "overview": "With many people fearing the actions of super heroes, the government decides to push for the Hero Registration Act, a law that limits a hero's actions. This results in a division in The Avengers. Iron Man stands with this Act, claiming that their actions must be kept in check otherwise cities will continue to be destroyed, but Captain America feels that saving the world is daring enough and that they cannot rely on the government to protect the world.",
      "img": "https://www.2embed.cc/thumbs/captain-america-civil-war-2016.jpg",
      "genre": "Action,Adventure,Sci-Fi",
      "country": "USA",
      "release": "2016"
    },
    {
      "id": 58,
      "name": "Battle for Sevastopol",
      "iframe": "https://www.2embed.cc/embed/tt4084744",
      "overview": "The breakout of the war shatters the world of a young student, Lyudmila Pavlichenko, forcing her to enlist in the army in 1941. The maiden turns out to be a natural-born sniper, her impressive skill and prowess make her stand out among men and women alike. Seeing Pavlichenko as a tangible threat, the German High Command gives orders to eliminate the girl whatever the cost. In the meanwhile, Lyudmila meets a man and falls in love. War fades into the background... Soon, however, another misfortune befalls Lyudmila leaving the man she loves on the brink of death and herself seriously wounded. The girl is pulled out of combat and later goes to the United States with a publicity visit.",
      "img": "https://www.2embed.cc/thumbs/battle-for-sevastopol-2015.jpg",
      "genre": "Action,Drama,Romance,War",
      "country": "Russia",
      "release": "2015"
    },
    {
      "id": 59,
      "name": "Friday the 13th",
      "iframe": "https://www.2embed.cc/embed/tt0080761",
      "overview": "In 1957, a young boy named Jason drowns in a lake near Camp Crystal Lake. The next year, two counselors are murdered. In 1980, a descendant of the original owners reopens Camp Crystal Lake with some counselors' help. The counselors gets killed one by one by a mysterious person. Could it be Jason, out for revenge?",
      "img": "https://www.2embed.cc/thumbs/friday-the-13th-1980.jpg",
      "genre": "Action,Horror,Thriller",
      "country": "USA",
      "release": "1980"
    },
    {
      "id": 60,
      "name": "Guardians of the Galaxy Vol. 2",
      "iframe": "https://www.2embed.cc/embed/tt3896198",
      "overview": "After saving Xandar from Ronan's wrath, the Guardians are now recognized as heroes. Now the team must help their leader Star Lord (Chris Pratt) uncover the truth behind his true heritage. Along the way, old foes turn to allies and betrayal is blooming. And the Guardians find that they are up against a devastating new menace who is out to rule the galaxy.",
      "img": "https://www.2embed.cc/thumbs/guardians-of-the-galaxy-vol-2-2017.jpg",
      "genre": "Action,Adventure,Sci-Fi,Comedy",
      "country": "USA",
      "release": "2017"
    }
  ]
}
